codebase/projects/ws-client/misc/RequestSecurityToken_ADFS_proper.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:a="http://www.w3.org/2005/08/addressing"
	xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<a:To s:mustUnderstand="1">https://r0177808idm.mayo.edu/adfs/services/trust/13/usernamemixed/
		</a:To>
		<o:Security s:mustUnderstand="1"
			xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="_0">
				<u:Created>2010-09-22T19:10:50.050Z</u:Created>
				<u:Expires>2010-09-22T22:38:50.050Z</u:Expires>
			</u:Timestamp>
			<!--
				o:UsernameToken u:Id="uuid-66056bcf-f62d-4047-9ca8-ee7dbbbff9fe-1"
			-->
			<o:UsernameToken>
				<o:Username>user</o:Username>
				<!--
					o:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">p@ssw0rd</o:Password
				-->
				<o:Password>password</o:Password>
			</o:UsernameToken>
		</o:Security>
	</s:Header>
	<s:Body>
		<trust:RequestSecurityToken
			xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
			<wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
				<a:EndpointReference>
					<a:Address>http://www.sample.com/</a:Address>
				</a:EndpointReference>
			</wsp:AppliesTo>
			<trust:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
			<trust:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</trust:RequestType>
		</trust:RequestSecurityToken>
	</s:Body>
</s:Envelope>